# for문
# for 변수 in range(start, end, step):
#     반복할 코드
# 위 형식이 반복문의 기본 형태이며, 중첩이 가능함

# range(start,end,step) <- 여기서 start, end, step은 정수(ex. range( 1, 5, 2))
# start부터 end까지(end는 포함 안됨) step 만큼 즘가/감소된 값을 변수에 넣고 반복
# start랑 step은 생략이 가능
# start를 생략하면 0
# step을 생략하면 1
# range(5)        -> start와 step둘다 생략된 상태
# range(0,5)
# 위 세가지 모양만 있음

# for i in range(0,5,1):      # i변수에 범위(0,1,2,3,4)를 넣으면서 반복. 총 5번 반복
#     print(i)                # 반복할 코드에 변수 사용

# for i in range(0,5,1):
#     print('hello')          # 반복할 코드에 변수사용 X




#========================================================================================#


# 1부터 100까지 홀수만 출력 조지기

# for i in range(1,100,2):
#     print(i)


#========================================================================================#


# 5부터 100까지 5의 배수를 출력

# for k in range(5,105,5):
#     print(k)


#========================================================================================#


# 10000까지의 제곱수를 출력  print(x*x)

# for j in range(1,101,1):
#     print( j*j )


#========================================================================================#


# i = 0
# while(i < 5):
#     print(i)
#     i += 1      # i = i+1 이랑 같은뜻, 누적덧셈


#========================================================================================#


# 1분터 100까지 짝수만을 출력

# i = 0

# while(i < 101):
#     print(i)
#     i += 2


#========================================================================================#


# 1부터 100까지 분수를 출력

# i = 1
# while(i < 101):
#     print(1/i)
#     i += 1
    


#========================================================================================#


# 무한반복
# python에서는
# while(true):
#     코드

# 위와 같이  while에 True를 넣어 무한 반복이 가능함


# countinue 와 break
# continue, break는 for, while 둘다 사용 가능
# continue
# continue를 만나는 순간 다음 반복 진행

# for i in range(0, 10, 1):
#     if(i%2 == 0):
#         continue        # 짝수일 때 다음 반복으로, 즉 짝수는 출력 안됨
#     print(i)



# break
# break를 만나는 순간 반복문 종료

# i = 0
# while(True):
#     print(i)
#     if(i == 10):
#         break
#     i += 1

#========================================================================================#


# while(True):
#     print('메뉴를 선택해 주세요')
#     print('1. hello 출력')
#     print('2. hi 출력')
#     print('3. Exit')
#     menu = int(input())

#     if(menu == 1):
#         print('hello')
#     elif(menu == 2):
#         print('hi')
#     elif(menu == 3):
#         print('메뉴 프로그램을 종료 합니다')
#         break
#     else:
#         print("잘못 입력했습니다. 1~3 숫자를 입력해 주세요")
#         print()
#         print()
#         continue

#     print()
#     print()



#========================================================================================#


# 중첩 반복문 
# 반복문 내부에 반복문 있는 형식
# 반복문이 2번 중첩이면 이중첩, 3번 중첩이면 3중첩 3중첩 반복문이다. 실제로는 3중첩 이상은 사용XXXXXXXXXX

# for x in range(1, 10, 1):       # 총 9번 반복
#     for y in range(1, 10, 1):   # 총 81번 반복
#         print(x,'*',y,'=',x*y)



#========================================================================================#


# for x in range(1, 20, 1):       # 총 9번 반복
#     for y in range(1, 10, 1):   # 총 81번 반복
#         print(x,'*',y,'=',x*y)

#========================================================================================#


# while()로 만든 구구단
# x = 1
# while(x < 10) :
#     y = 1
#     while(y < 10) :
#         print(x, '*', y, "=", x*y)

#         y += 1

#     x += 1

# ========================================================================================#


# range() # 내부에 변수를 이용 가능
# for i in range(1, 10, 1) :
#     for j in range(1, i+1, 1) :     # range() 내부에서 바깥 반복 변수 사용
#         print(i, '*', j, '=', i*j)



#========================================================================================#


# 패턴 찾아야함
# 요기에서
# 1 <-----
# 2     ㅣ----이렇게 3묶음씩 한블럭으로 총 8번 반복되야함
# 3 <-----
# 2         매 3번마다 앞에 오는 숫자 1,2,3,4... 들을 변수 i로 정하고 8번 반복하게함
# 3   
# 4         그 밑에 딸려오는 값들 23,34,45... 들은 1에 0,1,2 더한 값들이됨(i+0, i+1, i+2)
# 3         
# 4         따라서 i에 더해지는 3개의 갑을 반복해주는 j를 만듦
# 5
# 4
# .
# .
# .

# for i in range(1,9,1):
#     for j in range(0,3,1):
#         print(i+j)


#========================================================================================#


# for i in range(1,6,1):
#     print("A")
#     for j in range(1,i+1,1):
#         print("B")

#========================================================================================#


# 줄바꿈 무시
# print()를 사용하면 자동적으로 다음줄로 넘어감
# 일부로 다음줄로 줄바꿈이 안되게 하려면 end=''를 사용

# print("Hi")
# print("Hello")

# print("Hi ", end='')
# print("Hello")


#========================================================================================#


# * 
# * * 
# * * * 
# * * * * 
# * * * * * 
# for i in range(1,6,1):
#     for j in range( 1,i+1,1):
#         print('* ',end ='')
#     print()               # 반복이 끝나고 줄 바꿔야함
    