# for문
# for 변수 in range(start, end, step):
#     반복할 코드
# 위 형식이 반복문의 기본 형태이며, 중첩이 가능함

# range(start,end,step) <- 여기서 start, end, step은 정수(ex. range( 1, 5, 2))
# start부터 end까지(end는 포함 안됨) step 만큼 즘가/감소된 값을 변수에 넣고 반복
# start랑 step은 생략이 가능
# start를 생략하면 0
# step을 생략하면 1
# range(5)        -> start와 step둘다 생략된 상태
# range(0,5)
# 위 세가지 모양만 있음

# for i in range(0,5,1):      # i변수에 범위(0,1,2,3,4)를 넣으면서 반복. 총 5번 반복
#     print(i)                # 반복할 코드에 변수 사용

# for i in range(0,5,1):
#     print('hello')          # 반복할 코드에 변수사용 X



#========================================================================================#


# 1부터 100까지 홀수만 출력 조지기

# for i in range(1,100,2):
#     print(i)


#========================================================================================#


# 5부터 100까지 5의 배수를 출력

# for k in range(5,105,5):
#     print(k)


#========================================================================================#


# 10000까지의 제곱수를 출력  print(x*x)

# for j in range(1,101,1):
#     print( j*j )


#========================================================================================#


# i = 0
# while(i < 5):
#     print(i)
#     i += 1      # i = i+1 이랑 같은뜻, 누적덧셈


#========================================================================================#


# 1분터 100까지 짝수만을 출력

# i = 0

# while(i < 101):
#     print(i)
#     i += 2


#========================================================================================#


# 1부터 100까지 분수를 출력

# i = 1
# while(i < 101):
#     print(1/i)
#     i += 1
    


#========================================================================================#


# 무한반복
# python에서는
# while(true):
#     코드

# 위와 같이  while에 True를 넣어 무한 반복이 가능함


# countinue 와 break
# continue, break는 for, while 둘다 사용 가능
# continue
# continue를 만나는 순간 다음 반복 진행

# for i in range(0, 10, 1):
#     if(i%2 == 0):
#         continue        # 짝수일 때 다음 반복으로, 즉 짝수는 출력 안됨
#     print(i)



# break
# break를 만나는 순간 반복문 종료

# i = 0
# while(True):
#     print(i)
#     if(i == 10):
#         break
#     i += 1

#========================================================================================#


while(True):
    print('메뉴를 선택해 주세요')
    print('1. hello 출력')
    print('2. hi 출력')
    print('3. Exit')
    menu = int(input())

    if(menu == 1):
        print('hello')
    elif(menu == 2):
        print('hi')
    elif(menu == 3):
        print('메뉴 프로그램을 종료 합니다')
        break
    else:
        print("잘못 입력했습니다. 1~3 숫자를 입력해 주세요")
        print()
        print()
        continue

    print()
    print()